//зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]
let mas = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

// //1. перебрати його циклом while
// let i = 0;
// while (i < mas.length){
//     console.log(mas[i]);
//     i++;
// }

// //9.1 всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// let i = mas.length - 1;
// while (i >= 0) {
//     console.log(mas[i]);
//     i--;
// }



// //2. перебрати його циклом for
// for (let i = 0; i < mas.length; i++) {
//     console.log(mas[i]);
// }

// //9.2 всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// for (let i = mas.length - 1; i >= 0; i--) {
//     console.log(mas[i])
// }



// //3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let i = 0;
// while (i < mas.length) {
//     if (mas[i] % 2 === 1) {
//         console.log(mas[i]);
//     }
//     i++;
// }

// //9.3 всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// let i = mas.length - 1;
// while (i >= 0) {
//     if (mas[i] % 2 === 1) {
//         console.log(mas[i]);
//     }
//     i--;
// }



// //4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (let i = 0; i < mas.length; i++) {
//     if (mas[i] % 2 === 1) {
//         console.log(mas[i]);
//     }
// }

// //9.4 всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// for (let i=mas.length-1; i>=0;i--){
//     if (mas[i] % 2 ===1){
//         console.log(mas[i])
//     }
// }



// //5. перебрати циклом while та вивести  числа тільки парні  значення
// let i = 0;
// while (i < mas.length) {
//     if (mas[i] % 2 === 0) {
//         console.log(mas[i]);
//     }
//     i++;
// }

// //9.5 всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// let i = mas.length - 1;
// while (i >= 0) {
//     if (mas[i] % 2 === 0) {
//         console.log(mas[i]);
//     }
//     i--;
// }



// //6. перебрати циклом for та вивести  числа тільки парні  значення
// for (let i = 0; i < mas.length; i++) {
//     if (mas[i] % 2 === 0) {
//         console.log(mas[i]);
//     }
// }

// //9.6 всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// for (let i = mas.length - 1; i >= 0; i--) {
//     if (mas[i] % 2 === 0) {
//         console.log(mas[i] + ' ');
//     }
// }



// //7. замінити кожне число кратне 3 на слово "okten"
// for (let i = 0; i < mas.length; i++) {
//     if (mas[i] % 3 === 0) {
//         mas[i] = "okten";
//     }
//     console.log(mas[i])
// }

// //9.7 всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// for (let i = mas.length - 1; i >= 0; i--) {
//     console.log(mas[i] + ' ');
// }



// //8. вивести масив в зворотньому порядку.
//
// for (let i = mas.length-1; i>=0 ; i--) {
//     console.log(mas[i] + ' ');
// }

