//- Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//  кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3) {
    console.log('це великий масив, в якому  3 і більше елементи.')
} else if (friends.length < 3) {
    console.log('це маленький масив, в якому менше 3-х елементів.')
}

//- Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let a = +prompt('Input');
let b = +prompt('Input');
let c = +prompt('Input');
if ((a > b && a < c) || (a > c && a < b)) {
    console.log(a)
} else if ((b > a && b < c) || (b > c && b < a)) {
    console.log(b)
} else if ((c > b && c < a) || (c < b && c > a)) {
    console.log(c)
}

//- Перепишіть конструкцію if з використанням умовного оператора '?'
// let result;
//  if (a + b < 4) {
//     result = 'Мало';
//  } else {
//     result = 'Багато';
//  }

let result = a + b < 4 ? 'Мало' : 'Багато';

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let e = -12;
let num = e > -100 && e < 0 ? 'число є негативним' : e === 0 ? 'число є нулем' : e < 100 && e > 0 ? 'число є позитивним' : 'спробуйте ще раз';
console.log(num);


